# 2-1

2 + 3
(3 + 6) * 8
2 ^ 3
5 %% 3
5 %/% 33

# 2-2
3 ** 4
3 ** 4

# 2-3
log(10) + 5
sqrt(25)
max(5, 3, 1)
min(5, 3, 1)
factorial(5)

# 2-4
a <- 10
b <- 10
c <- a + b
print(c)

# 2-5
NULL
NA
NaN
Inf
-Inf

'python'
"python"

# 2-6
a <- 10
b <- 20
a + b
a <- "A"
a + b # 에러

# 2-7
x <- c(1, 2, 3)
y <- c("a", "b", "c")
z <- c(T, T, F, T)
x
y
z

# 2-8
w <- c(1, 2, 3, "a", "b", "c")
w

w <- c(1, 2, 3, 4, 5, 6, 7, 8, 9, "a", "b", "c")
w # 콘솔에 표시되는 [n]은 해당 줄 첫 항목의 순번이다. R의 첫번째는 1부터 시작


